use rxmedical;

DROP TABLE IF EXISTS history;
DROP TABLE IF EXISTS record;
DROP TABLE IF EXISTS user;
DROP TABLE IF EXISTS product;

-- User
SELECT * FROM user; 

INSERT INTO `user` (`emp_code`, dept, title, `name`, email, salt, password, auth_level, create_date, update_date) VALUES
('00000', '衛材庫房', 'root', 'root', 'root@root.com', '8b4c873ac087c7a553642d528f60aa8e', '6e29fc2a04004b7a9aa1fe986309e49bf9e4123171993d896ad4a179565c7caa', 'root', NOW(), NOW()),
('73174', '秘書室', '替代役', '王俊傑', 'school832@gmail.com', '94f725be236567bb57d77708ac9b45aa', 'caa6a26d3a35d0c99c161543cac20d2e68258a211993091d3ff6298ae52fe95f', 'admin', NOW(), NOW()),
('12345', '文書中心', '一般專員', '金一蓉', 'test@test.com', '24d518fae3d305a2df5a1ca3aaeca769', 'f3f6446f9cb3f981912a21e25d33246019ddb650361f31fd1d8f5a431aa939ad', 'staff', NOW(), NOW());

-- 商品進貨
SELECT * FROM product;
SELECT * FROM history;

SELECT p.stock, h.quantity FROM product p left join history h on p.id = h.product_id;

INSERT INTO `product` (`code`, `name`, `stock`, `storage`, picture, category, `description`, create_date, update_date) VALUES
('CZ1234567890', '石膏鞋', 30, '01-02-05', 'product-1.png', '石膏', '單位是一隻不是一雙喔', NOW(), NOW()),
('AC1234567890', '彈性繃帶', 300, '03-02-01', 'product-2.png', '蹦帶', '心理經常類別充滿，操作那麼多主體星座特殊注重接下來照片檢索外國支撐就業當你加工，部門聯繫方式聰明版權所有試試電子商務終於喜愛，播放採用右鍵，上次用於，空間有的魯蛇證件委託花園重量產業魔法關係手指，尺寸練習，總是部門，也有一項，資訊離開自身貼圖眼睛，品質哪。',  NOW(), NOW()),
('PI1234567890', '網狀繃帶', 330, '11-02-05', 'product-3.png', '蹦帶', '心理經常類別充滿，操作那麼多主體星座特殊注重接下來照片檢索外國支撐就業當你加工，部門聯繫方式聰明版權所有試試電子商務終於喜愛，播放採用右鍵，上次用於，空間有的魯蛇證件委託花園重量產業魔法關係手指，尺寸練習，總是部門，也有一項，資訊離開自身貼圖眼睛，品質哪。', NOW(), NOW()),
('RU1234567890', '氧氣面罩', 30, '12-02-03', 'product-4.png', '呼吸照護', '心理經常類別充滿，操作那麼多主體星座特殊注重接下來照片檢索外國支撐就業當你加工，部門聯繫方式聰明版權所有試試電子商務終於喜愛，播放採用右鍵，上次用於，空間有的魯蛇證件委託花園重量產業魔法關係手指，尺寸練習，總是部門，也有一項，資訊離開自身貼圖眼睛，品質哪。', NOW(), NOW()),
('OD1234567890', '甦醒球', 30, '00-02-05', 'product-5.png', '呼吸照護', '發達進步客服，女生一陣有的主要圖象爭取打印空間發佈日期管理員，觀點原文，訊息寫真鬱悶電視體系政治每日爭取填寫照顧方式實際上，行情不在房間學者笑道俱樂部職責，氣氛對面右鍵農民有一負責她說二手身體電視，存款交易自主原本出租時代神話真實很大畢業窗口，種類優秀無。', NOW(), NOW()),
('WM1234567890', '拋棄式手術刀', 100, '防疫庫房', 'product-6.png', '開刀房', '發達進步客服，女生一陣有的主要圖象爭取打印空間發佈日期管理員，觀點原文，訊息寫真鬱悶電視體系政治每日爭取填寫照顧方式實際上，行情不在房間學者笑道俱樂部職責，氣氛對面右鍵農民有一負責她說二手身體電視，存款交易自主原本出租時代神話真實很大畢業窗口，種類優秀無。', NOW(), NOW()),
('AP1234567890', '拋棄式刀片組', 300, '防疫庫房', 'product-7.png', '開刀房', '發達進步客服，女生一陣有的主要圖象爭取打印空間發佈日期管理員，觀點原文，訊息寫真鬱悶電視體系政治每日爭取填寫照顧方式實際上，行情不在房間學者笑道俱樂部職責，氣氛對面右鍵農民有一負責她說二手身體電視，存款交易自主原本出租時代神話真實很大畢業窗口，種類優秀無。',NOW(), NOW()),
('QP1234567890', 'PVC無粉手套-XS', 30, '00-00-00', 'product-8.png', '手套', '發達進步客服，女生一陣有的主要圖象爭取打印空間發佈日期管理員，觀點原文，訊息寫真鬱悶電視體系政治每日爭取填寫照顧方式實際上，行情不在房間學者笑道俱樂部職責，氣氛對面右鍵農民有一負責她說二手身體電視，存款交易自主原本出租時代神話真實很大畢業窗口，種類優秀無。', NOW(), NOW()),
('FN1234567890', 'PVC無粉手套-S', 30, '00-00-00', 'product-9.png', '手套', '福州裡面備案回答一路此刻小組溫州，清楚第二章其他的形象，點此積極麻煩幾個父母東方本文帳號網易社會風情，郵遞區號老闆事情產業萬華的確萬元這位背景大賽記住危險堅決，的錢感謝學院利益參觀二級萬元身體黑色高手網易大多但他第二天，電子郵件排行醫生，輕輕任務，夢想公。',NOW(), NOW()),
('UE1234567890', 'PVC無粉手套-M', 30, '00-00-00', 'product-10.png', '手套', '福州裡面備案回答一路此刻小組溫州，清楚第二章其他的形象，點此積極麻煩幾個父母東方本文帳號網易社會風情，郵遞區號老闆事情產業萬華的確萬元這位背景大賽記住危險堅決，的錢感謝學院利益參觀二級萬元身體黑色高手網易大多但他第二天，電子郵件排行醫生，輕輕任務，夢想公。',NOW(), NOW()),
('CU1234567890', 'PVC無粉手套-L', 30, '00-00-00', 'product-11.png', '手套', '福州裡面備案回答一路此刻小組溫州，清楚第二章其他的形象，點此積極麻煩幾個父母東方本文帳號網易社會風情，郵遞區號老闆事情產業萬華的確萬元這位背景大賽記住危險堅決，的錢感謝學院利益參觀二級萬元身體黑色高手網易大多但他第二天，電子郵件排行醫生，輕輕任務，夢想公。',NOW(), NOW()),
('IB1234567890', 'PVC無粉手套-XL', 30, '00-00-00', 'product-12.png', '手套', '福州裡面備案回答一路此刻小組溫州，清楚第二章其他的形象，點此積極麻煩幾個父母東方本文帳號網易社會風情，郵遞區號老闆事情產業萬華的確萬元這位背景大賽記住危險堅決，的錢感謝學院利益參觀二級萬元身體黑色高手網易大多但他第二天，電子郵件排行醫生，輕輕任務，夢想公。',NOW(), NOW()),
('RZ1234567890', 'UNI原子筆0.38-藍', 30, '11-02-01', 'product-13.png', '文書', '人間行業那麼終於同學淡淡阿宅人民共和國，人大開發商而來排行榜廣場手續答案試題於是經歷時期別人，體現日期輔助但是，立場學校請教世界寵物大全解決，這麼多現代化生產對外處罰聯繫電話開發者大會，盯着零售，聽說喜歡讀者對比給予蘋果同學每個電器獎勵不到他對，物品教師。',NOW(), NOW()),
('RM1234567890', 'UNI原子筆0.38-紅', 30, '01-01-03', 'product-14.png', '文書', '人間行業那麼終於同學淡淡阿宅人民共和國，人大開發商而來排行榜廣場手續答案試題於是經歷時期別人，體現日期輔助但是，立場學校請教世界寵物大全解決，這麼多現代化生產對外處罰聯繫電話開發者大會，盯着零售，聽說喜歡讀者對比給予蘋果同學每個電器獎勵不到他對，物品教師。',NOW(), NOW()),
('XT1234567890', 'UNI原子筆0.38-黑', 30, '08-02-05', 'product-15.png', '文書', '人間行業那麼終於同學淡淡阿宅人民共和國，人大開發商而來排行榜廣場手續答案試題於是經歷時期別人，體現日期輔助但是，立場學校請教世界寵物大全解決，這麼多現代化生產對外處罰聯繫電話開發者大會，盯着零售，聽說喜歡讀者對比給予蘋果同學每個電器獎勵不到他對，物品教師。',NOW(), NOW()),
('EO1234567890', '環保清潔袋(超特大)', 30, '07-03-05', 'product-16.png', '垃圾袋', '無關到達一身溫度地面事情失敗背景站內，不然高效閲讀創新，公主減少突然風險廣場並在報價英雄發佈日期鐵路，生氣早上，同樣方式一看，行為順利及其不必歡迎記者精靈和諧姑娘，鎖定雙方編輯顯示，負責另外本地下載一顆您可以管理系統一致，小子一本一個家裡出現在容易配合上。',NOW(), NOW()),
('JW1234567890', '環保清潔袋(中)', 30, '01-05-05', 'product-17.png', '垃圾袋', '無關到達一身溫度地面事情失敗背景站內，不然高效閲讀創新，公主減少突然風險廣場並在報價英雄發佈日期鐵路，生氣早上，同樣方式一看，行為順利及其不必歡迎記者精靈和諧姑娘，鎖定雙方編輯顯示，負責另外本地下載一顆您可以管理系統一致，小子一本一個家裡出現在容易配合上。',NOW(), NOW()),
('TM1234567890', '環保清潔袋(小)', 30, '09-02-05', 'product-18.png', '垃圾袋', '無關到達一身溫度地面事情失敗背景站內，不然高效閲讀創新，公主減少突然風險廣場並在報價英雄發佈日期鐵路，生氣早上，同樣方式一看，行為順利及其不必歡迎記者精靈和諧姑娘，鎖定雙方編輯顯示，負責另外本地下載一顆您可以管理系統一致，小子一本一個家裡出現在容易配合上。',NOW(), NOW());

INSERT INTO `history` (`quantity`, `price`, `flow`, product_id, record_id, user_id, create_date, update_date) VALUES
(30, 10000, '進', 1, null, 1, NOW(), NOW()),
(300, 10000, '進', 2, null, 1, NOW(), NOW()),
(330, 10000, '進', 3, null, 1, NOW(), NOW()),
(30, 10000, '進', 4, null, 1, NOW(), NOW()),
(30, 10000, '進', 5, null, 1, NOW(), NOW()),
(100, 10000, '進', 6, null, 1, NOW(), NOW()),
(300, 10000, '進', 7, null, 1, NOW(), NOW()),
(30, 10000, '進', 8, null, 1, NOW(), NOW()),
(30, 10000, '進', 9, null, 1, NOW(), NOW()),
(30, 10000, '進', 10, null, 1, NOW(), NOW()),
(30, 10000, '進', 11, null, 1, NOW(), NOW()),
(30, 10000, '進', 12, null, 1, NOW(), NOW()),
(30, 10000, '進', 13, null, 1, NOW(), NOW()),
(30, 10000, '進', 14, null, 1, NOW(), NOW()),
(30, 10000, '進', 15, null, 1, NOW(), NOW()),
(30, 10000, '進', 16, null, 1, NOW(), NOW()),
(30, 10000, '進', 17, null, 1, NOW(), NOW()),
(30, 10000, '進', 18, null, 1, NOW(), NOW());
